#+TITLE: Perspective I
#+AUTHOR: Chris Hogan
#+DATE: <2020-11-09 Mon> to <2020-12-06 Sun>
#+STARTUP: nologdone

* Marshall Vandruff's Perspective Lectures
** 01 - Intro
   - Oblique lines are lines that are neither right angles nor parallel.
     - Obtuse angle is > 90 degrees
     - Acute angle is < 90 degrees
   - 5 Ways to Create the Illusion of depth
     - Diminution
     - Foreshortening
     - Convergence of parallel lines
     - Aerial or Atmospheric perspective
     - Overlapping
   - Three dimensions
     - x is left and right
     - y is up and down
     - z is front and back
     - In a front or back view, z is completely foreshortened
     - In a top or bottom view, y is completely foreshortened
     - In a side view, x is completely foreshortened
     - Oblique view is another term for 3/4 view
*** TODO Draw cubes at every angle
      - Start with cubes
      - Next, move to everyday objects reduced to boxes
      - Build up the complex forms in the box, relating every line to the box
      - Compare draft views (top, side, and front) with oblique view
      - Simplify complexity by using simple forms
** 02 - Right Angles 1
   - First step of any view (window of the viewing plane) is to determine the
     POV height, or horizon line.
   - Horizon line is same as eye level.
   - Higher eye level means looking down on things, and vice versa
   - Station point is eye position on the horizontal axis
** 03 - Right Angles 2
   - Proximity is how close the observer is to an object
   - Shorter focal length means more acute viewing cone
   - The vanishing points get closer together as the observer gets closer to the
     object.
** 04 - Right Angles 3
   - Interior corners recess into space. Exterior corners come towards the
     observer.
   - Structural approach means seeing hidden lines to be able to draw through
     the forms to solve problems.
   - Don't use spatial integrity to the detriment of compositional integrity.
     Start with comp study where you don't think about perspective.
   - Don't let perspective rules turn your figures into robots. Start with
     gesture to keep the flow.
** 05 - Circles and Ellipses 1
* Marshall Vandruff's Perspective Assignments
** TODO Form Analysis 1 - Box it Up
   - Simplify a 3d form in a 3/4 view and reduce it only to boxes.
** TODO Form Analysis 2 - Draft and Oblique
   - Choose another object. Draw 3 draft views (one directly looking at x, 1 at
     y, and 1 at z), making sure points align on each view, then eyeball and
     draw a 3/4 view.
** TODO Form Analysis 3 - New Position from Imagination
   - Redraw the object from assignment 1 but imagining it in a new position.
** TODO Cube Contraption
   - Keep cutting away at a large cube to form a cube contraption
** TODO Collect Inspirations

* Perspective Drawing Handbook - Joseph D'Amelio
** Chapter 1 - Fundamentals
   - Diminution - Objects appear smaller as their distance from the viewer
     increases
   - Foreshortening - Lines or surfaces parallel to the observer's face show
     their maximum size. As they are revolved away from the observer, they
     appear increasingly shorter.
   - Convergence - Lines which are parallel in reality appear to converge as
     they recede from the observer. Diminution plus foreshortening.
   - Overlapping - closer objects overlap more distant objects.
   - Shade and Shadows - the way light falls on a 3d object gives it its form
   - Color and value perspective - color and values become grayer, weaker and
     more neutral as their distance from the observer increases.
   - Detail and Pattern Perspective - details and textures become fuzzier when
     far away.
   - Focus Effect - If they eye is focused on a distant object, the foreground
     becomes blurred, and vice versa. This technique is rarely used.
** Chapter 3 - How We See for Perspective Drawing
   - Central visual ray is center and focus of cone of vision, which is 45-60
     degrees.
   - Picture plane is between viewer and subject and is perpendicular to central
     visual ray.
   - Canvas or piece of paper is the picture plane.
** Chapter 4 - Why Appearance Differs from Reality
   - Diminution happens because of the way lines of sight hit the picture plane.
   - Convergance happens because lines of sight of the far ends appear closer
     together on the picture plane the the near ends.
   - Foreshortening happens because lines of sight get closer together on the
     picture plane as an object points toward or away from the viewer.
   - Overlapping objects prevent lines of sight from hitting the picture plane.
** Chapter 5 - Vanishing Points and Eye Level
   - Receding parallel lines will appear to meet at a vanishing point
   - Each set of parallel lines has its own vanishing point
   - All horizontal lines (parallel to the ground in reality) converge to a
     single horizontal vanishing line at eye level.
   - Observer's eye level dictates the location of the horizon line.
   - The vanishing point for any set of parallel lines is the point at which the
     sight line parallel to the set intersects the picture plane.
   - High eye level is looking down, low eye level is looking up
** Chapter 6 - Drawing the Cube
   - Cubes oriented in many directions result in many sets of converging lines
     and vanishing points on the horizon line.
** Chapter 7 - When and Why 1 and 2 Point Perspective
** Chapter 8 - More on Looking Up, Down and Straight Ahead
   - Things usually seen from below or above should be drawn with converging
     verticals.
** Chapter 9 - Perspective Distortion
   - Distortion occurs when an object is outside the cone of vision
   - Distortion can be fixed by placing vanishing points farther apart
     - Emulates stepping back from the picture plane, which provides a wider
       cone of vision.
** Chapter 10 - Determining Heights and Widths
** Chapter 11 - Determining Depths
   - Use diagonals to locate the midpoint of any rectangle or square in
     perspective
   - When dividing into non power of 2 spaces, horizontal division can be on any
     scale. A line from the last point through the far corner of the object to
     the horizon line gives the special vanishing point.
   - Horizontal line with special vanishing point also works for uneven divisions
   - Any design or pattern can be reproduced in perspective by using a grid that
     locates its important points.

* Log
** Week 1
#+BEGIN: clocktable :scope subtree :maxlevel 4
#+CAPTION: Clock summary at [2020-11-15 Sun 18:46]
| Headline                                       | Time    |       |      |      |
|------------------------------------------------+---------+-------+------+------|
| *Total time*                                   | *19:08* |       |      |      |
|------------------------------------------------+---------+-------+------+------|
| \_  Week 1                                     |         | 19:08 |      |      |
| \_    <2020-11-09 Mon>                         |         |       | 2:41 |      |
| \_      cylinders 20 min                       |         |       |      | 0:20 |
| \_      drawabox lesson 4 overview             |         |       |      | 0:58 |
| \_      Marshall's perspective lecture 1       |         |       |      | 0:36 |
| \_      D'Amelio book chapter 1                |         |       |      | 0:27 |
| \_      draw boxes                             |         |       |      | 0:20 |
| \_    <2020-11-10 Tue>                         |         |       | 2:56 |      |
| \_      cylinders                              |         |       |      | 0:19 |
| \_      drawabox lesson 4                      |         |       |      | 1:00 |
| \_      Marshall perspective q&a               |         |       |      | 1:09 |
| \_      D'Amelio book chapters 2-4             |         |       |      | 0:28 |
| \_    <2020-11-11 Wed>                         |         |       | 2:49 |      |
| \_      cylinders                              |         |       |      | 0:22 |
| \_      drawabox louse demo, 1 page of...      |         |       |      | 1:00 |
| \_      Marshall perspective lecture 2         |         |       |      | 0:36 |
| \_      D'Amelio book                          |         |       |      | 0:40 |
| \_      drawabox black widow                   |         |       |      | 0:11 |
| \_    <2020-11-12 Thu>                         |         |       | 2:05 |      |
| \_      cylinders                              |         |       |      | 0:19 |
| \_      drawabox fly, scorpion and short demos |         |       |      | 1:18 |
| \_      D'Amelio book chapter 6                |         |       |      | 0:28 |
| \_    <2020-11-13 Fri>                         |         |       | 2:14 |      |
| \_      cylinders                              |         |       |      | 0:20 |
| \_      drawabox                               |         |       |      | 1:00 |
| \_      Marshall Lecture                       |         |       |      | 0:32 |
| \_      D'Amelio                               |         |       |      | 0:22 |
| \_    <2020-11-14 Sat>                         |         |       | 3:41 |      |
| \_      Conan castle                           |         |       |      | 1:55 |
| \_      Cylinders                              |         |       |      | 0:56 |
| \_      drawabox insects                       |         |       |      | 0:19 |
| \_      D'Amelio chapter 9                     |         |       |      | 0:31 |
| \_    <2020-11-15 Sun>                         |         |       | 2:42 |      |
| \_      Croquis Cafe                           |         |       |      | 0:20 |
| \_      Cylinders                              |         |       |      | 0:27 |
| \_      drawabox insects                       |         |       |      | 0:26 |
| \_      D'Amelio book                          |         |       |      | 0:50 |
| \_      Marshall lecture 4                     |         |       |      | 0:39 |
#+END:

*** <2020-11-09 Mon>
**** DONE cylinders 20 min
     :LOGBOOK:
     CLOCK: [2020-11-09 Mon 7:45]--[2020-11-09 Mon 8:05] =>  0:20
     :END:
**** DONE drawabox lesson 4 overview
     :LOGBOOK:
     CLOCK: [2020-11-09 Mon 18:37]--[2020-11-09 Mon 19:35] =>  0:58
     :END:
**** DONE Marshall's perspective lecture 1
     :LOGBOOK:
     CLOCK: [2020-11-09 Mon 19:45]--[2020-11-09 Mon 20:21] =>  0:36
     :END:
**** DONE D'Amelio book chapter 1
     :LOGBOOK:
     CLOCK: [2020-11-09 Mon 20:44]--[2020-11-09 Mon 21:11] =>  0:27
     :END:
**** DONE draw boxes
     :LOGBOOK:
     CLOCK: [2020-11-09 Mon 21:11]--[2020-11-09 Mon 21:31] =>  0:20
     :END:
*** <2020-11-10 Tue>
**** DONE cylinders
     :LOGBOOK:
     CLOCK: [2020-11-10 Tue 07:45]--[2020-11-10 Tue 08:04] =>  0:19
     :END:
**** DONE drawabox lesson 4
     :LOGBOOK:
     CLOCK: [2020-11-10 Tue 18:11]--[2020-11-10 Tue 19:11] =>  1:00
     :END:
**** DONE Marshall perspective q&a
     :LOGBOOK:
     CLOCK: [2020-11-10 Tue 20:44]--[2020-11-10 Tue 21:07] =>  0:23
     CLOCK: [2020-11-10 Tue 19:18]--[2020-11-10 Tue 20:04] =>  0:46
     :END:
**** DONE D'Amelio book chapters 2-4
     :LOGBOOK:
     CLOCK: [2020-11-10 Tue 20:15]--[2020-11-10 Tue 20:43] =>  0:28
     :END:
*** <2020-11-11 Wed>
**** DONE cylinders
     :LOGBOOK:
     CLOCK: [2020-11-11 Wed 07:48]--[2020-11-11 Wed 08:10] =>  0:22
     :END:
**** DONE drawabox louse demo, 1 page of organic forms
     :LOGBOOK:
     CLOCK: [2020-11-11 Wed 18:11]--[2020-11-11 Wed 19:11] =>  1:00
     :END:
**** DONE Marshall perspective lecture 2
     :LOGBOOK:
     CLOCK: [2020-11-11 Wed 19:15]--[2020-11-11 Wed 19:51] =>  0:36
     :END:
**** DONE D'Amelio book
     :LOGBOOK:
     CLOCK: [2020-11-11 Wed 20:30]--[2020-11-11 Wed 21:10] =>  0:40
     :END:
**** DONE drawabox black widow
     :LOGBOOK:
     CLOCK: [2020-11-11 Wed 21:14]--[2020-11-11 Wed 21:25] =>  0:11
     :END:
*** <2020-11-12 Thu>
**** DONE cylinders
     :LOGBOOK:
     CLOCK: [2020-11-12 Thu 07:49]--[2020-11-12 Thu 08:08] =>  0:19
     :END:
**** DONE drawabox fly, scorpion and short demos
     :LOGBOOK:
     CLOCK: [2020-11-12 Thu 19:05]--[2020-11-12 Thu 20:23] =>  1:18
     :END:
**** DONE D'Amelio book chapter 6
     :LOGBOOK:
     CLOCK: [2020-11-12 Thu 20:33]--[2020-11-12 Thu 21:01] =>  0:28
     :END:
*** <2020-11-13 Fri>
**** DONE cylinders
     :LOGBOOK:
     CLOCK: [2020-11-13 Fri 07:47]--[2020-11-13 Fri 08:07] =>  0:20
     :END:
**** DONE drawabox
     :LOGBOOK:
     CLOCK: [2020-11-13 Fri 18:52]--[2020-11-13 Fri 19:52] =>  1:00
     :END:
**** DONE Marshall Lecture
     :LOGBOOK:
     CLOCK: [2020-11-13 Fri 20:05]--[2020-11-13 Fri 20:37] =>  0:32
     :END:
**** DONE D'Amelio
     :LOGBOOK:
     CLOCK: [2020-11-13 Fri 20:56]--[2020-11-13 Fri 21:18] =>  0:22
     :END:
*** <2020-11-14 Sat>
**** DONE Conan castle
     :LOGBOOK:
     CLOCK: [2020-11-14 Sat 09:50]--[2020-11-14 Sat 11:45] =>  1:55
     :END:
**** DONE Cylinders
     :LOGBOOK:
     CLOCK: [2020-11-14 Sat 14:15]--[2020-11-14 Sat 15:11] =>  0:56
     :END:
**** DONE drawabox insects
     :LOGBOOK:
     CLOCK: [2020-11-14 Sat 18:38]--[2020-11-14 Sat 18:57] =>  0:19
     :END:
**** DONE D'Amelio chapter 9
     :LOGBOOK:
     CLOCK: [2020-11-14 Sat 19:27]--[2020-11-14 Sat 19:58] =>  0:31
     :END:
*** <2020-11-15 Sun>
**** DONE Croquis Cafe
     :LOGBOOK:
     CLOCK: [2020-11-15 Sun 09:40]--[2020-11-15 Sun 10:00] =>  0:20
     :END:
**** DONE Cylinders
     :LOGBOOK:
     CLOCK: [2020-11-15 Sun 10:12]--[2020-11-15 Sun 10:39] =>  0:27
     :END:
**** DONE drawabox insects
     :LOGBOOK:
     CLOCK: [2020-11-15 Sun 10:41]--[2020-11-15 Sun 11:07] =>  0:26
     :END:
**** DONE D'Amelio book
     :LOGBOOK:
     CLOCK: [2020-11-15 Sun 11:09]--[2020-11-15 Sun 11:59] =>  0:50
     :END:
**** DONE Marshall lecture 4
     :LOGBOOK:
     CLOCK: [2020-11-15 Sun 13:01]--[2020-11-15 Sun 13:40] =>  0:39
     :END:
**** DONE blog
** Week 2
#+BEGIN: clocktable :scope subtree :maxlevel 4
#+CAPTION: Clock summary at [2020-11-15 Sun 18:48]
| Headline     | Time   |
|--------------+--------|
| *Total time* | *0:00* |
#+END:

*** 
